[
  {
    "id": "bpc-157",
    "name": "BPC-157",
    "category": "Recovery",
    "shortDescription": "Accelerates healing of wounds, tendons, muscles, ligaments and gut lining",
    "description": "A synthetic 15-amino acid peptide from human gastric juice that accelerates healing of wounds, tendons, muscles, ligaments and gut lining. It has powerful anti-inflammatory effects and is widely used for injury recovery and gut health in research and clinical wellness settings.",
    "mechanism": "Promotes angiogenesis and tissue repair by upregulating growth factor pathways (like VEGF and FAK-paxillin) and modulating nitric oxide signaling. It enhances fibroblast migration and survival, supporting regenerative processes in stressed tissues.",
    "commonDoses": "250-500 mcg once or twice daily (subcutaneous or intramuscular). Often administered for 4-6 weeks.",
    "protocol": "Inject subcutaneously or intramuscularly, ideally near the injury site for localized healing. Use daily for 4-6 weeks, then take a break. Can be combined with TB-500 for enhanced healing effects.",
    "sideEffects": "Generally well-tolerated. Some users report mild fatigue, dizziness, or headaches. Rare: Allergic reactions or injection site irritation.",
    "warnings": "Not FDA-approved for human use. Classified as experimental research peptide. Added to WADA's Prohibited List in 2022. Avoid if you have active cancer or tumors, as it promotes cell growth. Consult a physician before use.",
    "interactions": "No known major drug interactions. May enhance the effects of other healing peptides like TB-500 or growth hormone.",
    "injectionAreas": "Subcutaneous or intramuscular injection near the injury site for localized healing. For systemic effects, inject in the abdomen or thigh."
  },
  {
    "id": "tb-500",
    "name": "Thymosin Beta-4 (TB-500)",
    "category": "Recovery",
    "shortDescription": "Supports tissue repair, wound healing, and anti-inflammatory responses",
    "description": "A synthetic peptide derivative of natural thymosin β-4 that supports tissue repair and anti-inflammatory responses. Used experimentally to promote wound healing, tendon and ligament repair, and reduced inflammation in muscles and other tissues.",
    "mechanism": "Binds actin monomers to modulate cell migration and angiogenesis. It accelerates tissue regeneration by activating growth pathways and promoting blood vessel formation. Also reduces pro-inflammatory cytokines in injured tissue.",
    "commonDoses": "Loading phase: 2.0-2.5 mg every other day (or 4-8 mg per week) for several weeks. Maintenance: Less frequent doses after initial loading period.",
    "protocol": "Doses are typically divided into 2-3 injections per week. Use subcutaneous injection. Loading phase lasts 4-6 weeks, followed by maintenance dosing as needed.",
    "sideEffects": "Generally well-tolerated. Possible injection site reactions, mild fatigue, or headache. Long-term effects not fully studied.",
    "warnings": "Research-use only, not FDA-approved. Added to WADA's prohibited list as a peptide growth factor. Use in sports or humans outside approved research contexts is illegal.",
    "interactions": "Often combined with BPC-157 for synergistic healing effects. No known major drug interactions, but consult healthcare provider before combining with other medications.",
    "injectionAreas": "Subcutaneous injection in the abdomen, thigh, or near injury site. Rotate injection sites to prevent tissue irritation."
  },
  {
    "id": "ipamorelin",
    "name": "Ipamorelin",
    "category": "Growth",
    "shortDescription": "Selective growth hormone secretagogue for anti-aging and recovery",
    "description": "A selective Growth Hormone Secretagogue peptide that stimulates growth hormone release with minimal effect on cortisol or prolactin. Favored for anti-aging and recovery protocols to increase GH and IGF-1 levels, improving fat loss and muscle repair.",
    "mechanism": "Acts as a ghrelin receptor (GHS-R1a) agonist in the pituitary, triggering endogenous growth hormone release. Mimics ghrelin's GH-releasing effect, causing a dose-dependent GH pulse without significantly altering other hormones.",
    "commonDoses": "200-300 mcg per injection, typically 2-3 times daily (often before meals and at bedtime). Dosing adjusted to elicit optimal GH pulses.",
    "protocol": "Inject subcutaneously 2-3 times daily, preferably on an empty stomach. Common timing: morning upon waking, post-workout, and before bed. Cycle 8-12 weeks on, followed by 4 weeks off.",
    "sideEffects": "Mild: Headache, flushing, or increased hunger. Rare: Water retention, joint discomfort, or numbness in extremities.",
    "warnings": "Not FDA-approved for any indication (experimental research only). Banned by WADA as a growth factor (category S2). Not recommended for those with active cancer or diabetes.",
    "interactions": "Often stacked with CJC-1295 for synergistic GH release. May interact with insulin or diabetes medications. Avoid combining with exogenous growth hormone without medical supervision.",
    "injectionAreas": "Subcutaneous injection in the abdomen or thigh. Rotate sites to prevent lipohypertrophy."
  },
  {
    "id": "ghrp-6",
    "name": "GHRP-6",
    "category": "Growth",
    "shortDescription": "Powerful growth hormone secretagogue that also increases appetite",
    "description": "A hexapeptide GH secretagogue used to boost growth hormone release and appetite. Utilized for enhancing recovery, muscle growth, and sometimes for increasing appetite in low-weight conditions.",
    "mechanism": "Binds the ghrelin/GHS receptor (GHSR1a) on the pituitary, triggering strong GH release and a moderate appetite surge. Also antagonizes somatostatin briefly, amplifying GH secretion.",
    "commonDoses": "100-300 mcg per injection, 2-3 times per day, often around meals or before workouts. Some protocols use pre-sleep dosing to leverage nocturnal GH rise.",
    "protocol": "Inject subcutaneously 2-3 times daily on an empty stomach. Wait 20-30 minutes before eating. Typical cycle: 8-12 weeks on, 4 weeks off.",
    "sideEffects": "Increased hunger (most common), water retention, tingling or numbness in hands/feet, joint pain, elevated cortisol at high doses.",
    "warnings": "Experimental only, not approved for clinical use. Classified as banned peptide hormone by WADA (S2). Not suitable for those with active cancer or uncontrolled diabetes.",
    "interactions": "Can be combined with CJC-1295 for enhanced GH response. May affect blood sugar levels. Consult doctor if taking diabetes medications.",
    "injectionAreas": "Subcutaneous injection in abdomen or thigh. Rotate injection sites regularly."
  },
  {
    "id": "ghrp-2",
    "name": "GHRP-2",
    "category": "Growth",
    "shortDescription": "Stimulates growth hormone release with less hunger than GHRP-6",
    "description": "Similar to GHRP-6, used to stimulate endogenous GH secretion and promote recovery. Reported to increase lean mass and metabolic rate with less effect on hunger than GHRP-6.",
    "mechanism": "Agonist of the GHSR1a (ghrelin) receptor that induces pulsatile GH release. Leads to increased IGF-1 without significantly affecting cortisol.",
    "commonDoses": "100-200 mcg per injection, 2-3 times daily (before meals and at bedtime). Similar protocols to GHRP-6.",
    "protocol": "Subcutaneous injection 2-3 times daily on empty stomach. Common timing: morning, post-workout, before bed. Cycle 8-12 weeks, then take 4 weeks off.",
    "sideEffects": "Less hunger increase than GHRP-6. Possible water retention, tingling sensations, mild headache, or joint discomfort.",
    "warnings": "Research-only peptide. Any GH secretagogue including GHRP-2 is prohibited under WADA S2. Not for use with active cancer or diabetes.",
    "interactions": "Often combined with CJC-1295 for synergistic effects. May interact with insulin or blood sugar medications.",
    "injectionAreas": "Subcutaneous injection in abdomen or thigh. Rotate injection sites to prevent tissue buildup."
  },
  {
    "id": "hexarelin",
    "name": "Hexarelin",
    "category": "Growth",
    "shortDescription": "One of the most potent growth hormone secretagogues available",
    "description": "A potent synthetic GHRP used to stimulate GH release for anti-aging and muscle-repair purposes. One of the most powerful GH secretagogues available.",
    "mechanism": "Binds GHSR1a (ghrelin receptor) with high affinity, inducing a strong GH surge. Unlike some GHRPs, it has minimal effect on appetite.",
    "commonDoses": "100-200 mcg per injection, 1-3 times daily. Common protocol: 200 mcg once in morning, 200 mcg before sleep.",
    "protocol": "Inject subcutaneously 1-3 times daily. Due to its potency, shorter cycles are recommended (4-8 weeks) with longer breaks (8-12 weeks) to prevent desensitization.",
    "sideEffects": "Water retention, increased hunger (less than GHRP-6), joint pain, carpal tunnel symptoms at high doses. May cause desensitization with prolonged use.",
    "warnings": "Not FDA-approved, sold only as research peptide. Banned by WADA for athletic use. Can cause receptor desensitization, so cycling is essential.",
    "interactions": "Very potent; avoid stacking with multiple GH secretagogues. May interact with diabetes medications.",
    "injectionAreas": "Subcutaneous injection in abdomen or thigh. Rotate sites regularly."
  },
  {
    "id": "cjc-1295",
    "name": "CJC-1295",
    "category": "Growth",
    "shortDescription": "Long-acting GHRH analog for sustained growth hormone elevation",
    "description": "A synthetic Growth Hormone Releasing Hormone analog. CJC-1295 with DAC has a half-life of 6-8 days, causing sustained GH/IGF-1 elevation. Used to increase GH for anti-aging, fat loss, and recovery. The no-DAC form (ModGRF 1-29) yields short GH pulses.",
    "mechanism": "Activates the pituitary GHRH receptor, stimulating GH release. The DAC form binds albumin to extend its action for prolonged GH elevation throughout the week.",
    "commonDoses": "With DAC: 1-2 mg injected 1-2 times per week. Without DAC (ModGRF): 0.5-1.0 mg subcutaneously about 5 times per week.",
    "protocol": "With DAC: Inject once or twice weekly for sustained GH levels. Without DAC: Inject 2-3 times daily, often combined with Ipamorelin or GHRP peptides for synergistic effect.",
    "sideEffects": "Water retention, joint pain, tingling in extremities, increased hunger, fatigue. With DAC: More sustained side effects due to longer half-life.",
    "warnings": "Research peptide only. GHRH analogs like CJC-1295 are prohibited by WADA (S2.2.3) as growth hormone modulators. Not for use with active cancer or diabetes.",
    "interactions": "Commonly stacked with Ipamorelin for optimal GH release. May interact with insulin or diabetes medications.",
    "injectionAreas": "Subcutaneous injection in abdomen or thigh. Rotate sites to prevent lipohypertrophy."
  },
  {
    "id": "sermorelin",
    "name": "Sermorelin",
    "category": "Growth",
    "shortDescription": "Natural GHRH analog for physiological growth hormone stimulation",
    "description": "A natural 29-amino acid GHRH analog once used to diagnose GH deficiency. Now primarily used off-label for growth hormone stimulation in adults, particularly in anti-aging clinics.",
    "mechanism": "Mimics endogenous GHRH to drive the release of growth hormone from the pituitary. Produces physiological GH pulses similar to natural patterns.",
    "commonDoses": "200-500 mcg injected subcutaneously once daily, typically at night before bed to align with natural GH release patterns.",
    "protocol": "Inject subcutaneously once daily, preferably before bedtime. Use consistently for at least 3-6 months to see full benefits. Often cycled long-term.",
    "sideEffects": "Mild: Injection site reactions, flushing, headache. Rare: Dizziness, hyperactivity, or difficulty swallowing.",
    "warnings": "FDA-approved for GH deficiency diagnosis in children (no longer marketed since 2008). In adults it's used off-label via compounding pharmacies. Would be considered doping if used for athletic performance.",
    "interactions": "May be affected by medications that influence pituitary function. Consult doctor if taking thyroid or cortisol medications.",
    "injectionAreas": "Subcutaneous injection in abdomen. Rotate sites nightly."
  },
  {
    "id": "igf-1-lr3",
    "name": "IGF-1 LR3",
    "category": "Growth",
    "shortDescription": "Long-acting IGF-1 analog for enhanced muscle growth and recovery",
    "description": "A long-acting analog of IGF-1 used to enhance muscle growth, recovery, and fat metabolism. More potent and longer-lived than native IGF-1.",
    "mechanism": "Binds the IGF-1 receptor on muscle and other cells, activating intracellular anabolic pathways (PI3K/Akt/mTOR and MAPK) to promote protein synthesis, satellite cell activation, and tissue repair. Unlike GH, IGF-1 acts directly on tissues.",
    "commonDoses": "20-50 mcg per day. Because IGF-1 LR3 bypasses IGF-binding proteins, microdoses are effective. Exact protocols not standardized.",
    "protocol": "Inject subcutaneously or intramuscularly daily, often post-workout. Typical cycles: 4-6 weeks on, 4 weeks off to prevent receptor desensitization.",
    "sideEffects": "Hypoglycemia (low blood sugar), joint pain, organ enlargement with long-term use, jaw/facial changes at high doses.",
    "warnings": "Experimental only. Exogenous IGF-1 is explicitly banned by WADA (S2 peptide hormone category). May promote tumor growth. Not for use with diabetes or cancer.",
    "interactions": "Can cause dangerous hypoglycemia, especially with insulin or diabetes medications. Avoid alcohol.",
    "injectionAreas": "Subcutaneous in abdomen or intramuscular in target muscle groups post-workout."
  },
  {
    "id": "peg-mgf",
    "name": "PEG-MGF",
    "category": "Recovery",
    "shortDescription": "PEGylated mechano growth factor for localized muscle repair",
    "description": "A modified form of the IGF-1 splice variant MGF, designed for enhanced stability. Used to accelerate muscle repair and localized muscle growth after training or injury.",
    "mechanism": "Targets the site of muscle stress by activating satellite cells (muscle stem cells) and promoting local tissue regeneration. PEGylation prolongs its action (half-life 24-36 hours). Synergizes with systemic IGF-1/GH, initiating repair in specific muscles.",
    "commonDoses": "200-400 mcg per injection, injected near the exercised muscle 2-3 times per week (often immediately post-workout). Course typically lasts 4-6 weeks.",
    "protocol": "Inject near the trained muscle group immediately after workout for localized effects. Use 2-3 times per week on training days. Cycle 4-6 weeks on, then take equal time off.",
    "sideEffects": "Localized muscle soreness, injection site reactions. Systemic effects are minimal due to localized action.",
    "warnings": "Experimental peptide. As a growth factor, any exogenous IGF-1 variant is considered doping and banned by WADA. Not FDA-approved.",
    "interactions": "Often used with systemic GH or IGF-1 for enhanced results. No major drug interactions known.",
    "injectionAreas": "Intramuscular injection directly into the trained muscle group post-workout for localized repair benefits."
  },
  {
    "id": "aod-9604",
    "name": "AOD-9604",
    "category": "Weight Loss",
    "shortDescription": "Growth hormone fragment for targeted fat loss without growth effects",
    "description": "A 15-amino acid fragment of human growth hormone (positions 176-191) developed specifically for fat loss. Mimics GH's lipolytic effect without causing growth effects or raising IGF-1 levels.",
    "mechanism": "Stimulates lipolysis and fat oxidation, likely by upregulating beta-adrenergic receptors in fat tissue. Preclinical studies show it reduces body weight and body fat without affecting blood sugar or causing growth.",
    "commonDoses": "300-500 mcg per day, injected subcutaneously. Research varies; no approved standard dosing protocol.",
    "protocol": "Inject subcutaneously once daily, preferably in the morning on an empty stomach. Typical cycles: 8-12 weeks, can be extended as it doesn't affect hormones.",
    "sideEffects": "Generally well-tolerated. Possible headache, mild nausea, or injection site reactions. No significant hormonal side effects reported.",
    "warnings": "Never FDA-approved as a drug, marketed only as research peptide. Explicitly listed as prohibited GH fragment by WADA (S2.2.3).",
    "interactions": "No known significant drug interactions. May enhance effects of other fat-burning compounds.",
    "injectionAreas": "Subcutaneous injection in abdomen, preferably in areas with more fat for localized effects."
  },
  {
    "id": "thymosin-alpha-1",
    "name": "Thymosin Alpha-1",
    "category": "Immunity",
    "shortDescription": "Immune-modulating peptide for enhanced immune function and recovery",
    "description": "A 28-amino acid peptide that modulates immune function. Clinically used (as Zadaxin) for chronic hepatitis B/C, HIV, certain cancers, and immune deficiencies. Also used off-label for immune support and recovery enhancement.",
    "mechanism": "Enhances cell-mediated immunity by promoting T-cell (CD4+ and CD8+) maturation and natural killer (NK) cell activity. Balances cytokine production (increasing IL-2 and IFN-gamma while reducing excessive IL-6/TNF-alpha) to normalize immune response.",
    "commonDoses": "1.0-1.5 mg by subcutaneous injection, 2-3 times per week for general immune support. In acute illness: up to daily dosing for 1-2 weeks. Clinical trials have used 1.6 mg twice weekly.",
    "protocol": "Inject subcutaneously 2-3 times per week for ongoing immune support. For acute illness or during high-stress periods, can increase to daily for 1-2 weeks. Well-tolerated for long-term use.",
    "sideEffects": "Minimal side effects. Occasional injection site redness, mild fatigue initially as immune system adjusts. Very well-tolerated overall.",
    "warnings": "Approved in many countries as injectable drug (Zadaxin) for hepatitis and immunotherapy. In the US it is investigational. Not a controlled substance and not on WADA's banned list.",
    "interactions": "May enhance effects of vaccines and other immunotherapies. Generally safe to combine with other treatments. Consult doctor if immunocompromised.",
    "injectionAreas": "Subcutaneous injection in abdomen, thigh, or upper arm. Rotate sites regularly."
  },
  {
    "id": "melanotan-2",
    "name": "Melanotan II",
    "category": "Performance",
    "shortDescription": "Synthetic melanocortin analog for tanning and libido enhancement",
    "description": "A synthetic analog of alpha-MSH primarily used to induce skin tanning and pigmentation. Also has off-label use for libido enhancement due to its effects on melanocortin receptors.",
    "mechanism": "Agonist of melanocortin receptors (non-selective MC1, MC3, MC4, MC5). Activation of MC1R in skin stimulates melanin production for darker pigmentation. MC4R activation in the central nervous system accounts for libido-enhancing and appetite-suppressing effects.",
    "commonDoses": "Start at 0.125-0.25 mg and gradually titrate up (to 0.5-1 mg) injected a few times per week. No formal medical guidelines; protocols vary.",
    "protocol": "Start with low dose (0.125 mg) and increase gradually to assess tolerance. Inject subcutaneously 2-3 times per week. UV exposure recommended for tanning effects.",
    "sideEffects": "Nausea (especially initially), flushing, increased libido, spontaneous erections, darkening of moles and freckles, appetite suppression.",
    "warnings": "Not FDA-approved; sales are illegal in many countries. Health agencies have issued warnings since 2007. Sold only as unregulated research chemical. May increase risk of skin cancer with UV exposure.",
    "interactions": "May interact with medications affecting blood pressure. Avoid with other compounds affecting melanocortin receptors.",
    "injectionAreas": "Subcutaneous injection in abdomen or thigh."
  },
  {
    "id": "pt-141",
    "name": "PT-141 (Bremelanotide)",
    "category": "Performance",
    "shortDescription": "FDA-approved melanocortin agonist for sexual desire enhancement",
    "description": "A 7-amino acid melanocortin receptor agonist FDA-approved to treat hypoactive sexual desire disorder (HSDD) in premenopausal women. Marketed as Vyleesi for sexual arousal enhancement.",
    "mechanism": "Activates melanocortin receptors (especially MC4R) in the brain to increase sexual desire and arousal through central nervous system pathways. MC1R activation also causes mild tanning.",
    "commonDoses": "1.75 mg injected subcutaneously about 30-60 minutes before anticipated sexual activity. FDA-approved protocol is single 1.75 mg dose up to once every 24 hours.",
    "protocol": "Inject subcutaneously in abdomen or thigh 30-60 minutes before sexual activity. Do not use more than once in 24 hours or more than 8 times per month.",
    "sideEffects": "Nausea (most common, especially first dose), flushing, headache, injection site reactions. Transient increase in blood pressure.",
    "warnings": "FDA-approved for female HSDD (July 2019). Not recommended for those with uncontrolled high blood pressure or cardiovascular disease. Not a controlled substance.",
    "interactions": "May interact with blood pressure medications. Avoid alcohol as it may worsen side effects.",
    "injectionAreas": "Subcutaneous injection in abdomen or thigh, at least 2 inches away from navel."
  },
  {
    "id": "tesamorelin",
    "name": "Tesamorelin",
    "category": "Weight Loss",
    "shortDescription": "FDA-approved GHRH analog for reducing visceral abdominal fat",
    "description": "A synthetic 44-amino acid GHRH analog FDA-approved to reduce excess visceral fat in HIV-infected patients with lipodystrophy. Also explored for metabolic benefits in non-HIV populations.",
    "mechanism": "Stimulates the pituitary GHRH receptor to increase growth hormone secretion, thereby reducing visceral adiposity. Raises IGF-1 and reduces fat mass, particularly in the abdomen.",
    "commonDoses": "2 mg injected subcutaneously once daily. This corresponds to reconstituting a 2 mg vial per FDA labeling.",
    "protocol": "Inject 2 mg subcutaneously once daily, preferably at the same time each day. Typically used continuously; effects on visceral fat seen after 3-6 months.",
    "sideEffects": "Injection site reactions, joint pain, peripheral edema, muscle pain, elevated blood glucose. Less common: numbness, vomiting.",
    "warnings": "FDA-approved (brand name Egrifta) for HIV lipodystrophy. On WADA's prohibited list if used for athletic performance. May affect glucose metabolism; monitor if diabetic.",
    "interactions": "May interact with insulin or diabetes medications. Monitor blood glucose closely. May affect cortisol and other hormones.",
    "injectionAreas": "Subcutaneous injection in abdomen. Rotate sites to reduce irritation."
  },
  {
    "id": "follistatin-344",
    "name": "Follistatin 344",
    "category": "Growth",
    "shortDescription": "Myostatin inhibitor for enhanced muscle growth and strength",
    "description": "A myostatin-binding glycoprotein that promotes muscle growth and prevents muscle wasting. Of interest for combating sarcopenia and enhancing muscle development by blocking myostatin.",
    "mechanism": "Binds and inhibits myostatin (and activin), a natural negative regulator of muscle growth. Blocking myostatin releases its brake on muscle, leading to increased muscle mass and strength.",
    "commonDoses": "Highly experimental. Research doses vary; black-market products report 100-250 mcg subcutaneously per day in athletes, but no clinical guidelines exist.",
    "protocol": "Experimental protocols suggest daily subcutaneous injection for 4-8 weeks. No established medical protocols. Extremely limited human data.",
    "sideEffects": "Unknown in humans. Theoretical risks include uncontrolled muscle growth, metabolic changes, effects on other activin-related pathways.",
    "warnings": "No approved pharmaceutical form. Prohibited by WADA (categorized under Growth Factors S4). Not a controlled drug, but using for performance is doping. Highly experimental with unknown long-term effects.",
    "interactions": "Unknown. May interact with other growth factors or anabolic compounds.",
    "injectionAreas": "Subcutaneous injection, typically in abdomen. Experimental protocols vary."
  },
  {
    "id": "epitalon",
    "name": "Epitalon (Epithalon)",
    "category": "Anti-aging",
    "shortDescription": "Telomerase activator for anti-aging and longevity enhancement",
    "description": "A synthetic tetrapeptide (Ala-Glu-Asp-Gly) derived from the pineal gland peptide epithalamin. Used experimentally for anti-aging and longevity, notably to activate telomerase and lengthen telomeres in somatic cells.",
    "mechanism": "Stimulates telomerase activity, preserving or lengthening telomeres on chromosomes. Also appears to restore melatonin secretion and improve circadian rhythms, supporting cellular repair and immune function.",
    "commonDoses": "5-10 mg per day by subcutaneous injection for short courses, typically 10-20 days. These cycles are often repeated every 6-12 months in longevity protocols.",
    "protocol": "Inject subcutaneously once daily for 10-20 consecutive days. Repeat cycle every 6-12 months. Some protocols use longer cycles with breaks.",
    "sideEffects": "Minimal reported side effects. Possible injection site reactions. Long-term effects in humans not well studied.",
    "warnings": "Not FDA-approved (supplement or research peptide in most countries). No known performance-related bans. Use is mostly in experimental anti-aging contexts.",
    "interactions": "May enhance sleep and circadian rhythm. Can be combined with other longevity interventions. No known significant drug interactions.",
    "injectionAreas": "Subcutaneous injection in abdomen or thigh."
  },
  {
    "id": "mots-c",
    "name": "MOTS-c",
    "category": "Performance",
    "shortDescription": "Mitochondrial peptide for improved metabolism and endurance",
    "description": "A 16-amino acid mitochondrial-derived peptide involved in metabolic regulation. Researched for improving metabolic health, fat loss, insulin sensitivity, and mitochondrial function, with potential longevity benefits.",
    "mechanism": "Encoded by mitochondrial DNA, MOTS-c is released during stress (fasting/exercise) and activates AMPK, enhancing glucose uptake and fatty acid oxidation. Improves insulin sensitivity and promotes a shift toward fat burning, reducing fat accumulation and improving endurance.",
    "commonDoses": "5-15 mg per week, divided into 2-3 subcutaneous injections (e.g., 2-5 mg, 2-3 times weekly). Typical cycles last 2-4 weeks.",
    "protocol": "Inject subcutaneously 2-3 times per week. Some use around workouts for enhanced endurance. Cycles of 2-4 weeks with breaks in between.",
    "sideEffects": "Minimal reported. Possible injection site reactions, mild flushing. Generally well-tolerated in research contexts.",
    "warnings": "Research peptide with no clinical approvals. WADA has not specifically listed MOTS-c, but metabolic enhancement claims remain experimental. Not for use with severe metabolic disorders without medical supervision.",
    "interactions": "May enhance effects of exercise and fasting. Could interact with diabetes medications by improving insulin sensitivity.",
    "injectionAreas": "Subcutaneous injection in abdomen or thigh."
  },
  {
    "id": "semaglutide",
    "name": "Semaglutide",
    "category": "Weight Loss",
    "shortDescription": "GLP-1 for Weight Loss, Appetite Control & Blood Sugar Regulation",
    "description": "Semaglutide is a GLP-1 receptor agonist originally developed for type 2 diabetes. It's now widely used off-label for weight loss due to its ability to reduce appetite, slow digestion, and improve insulin sensitivity. It mimics the body's natural GLP-1 hormone, leading to improved metabolic function and fat loss when combined with lifestyle changes.",
    "mechanism": "Semaglutide activates GLP-1 receptors in the brain, pancreas, and gut. This leads to increased insulin secretion, decreased glucagon release, slowed gastric emptying, and reduced appetite through hypothalamic signaling.",
    "commonDoses": "Starting: 0.25mg weekly for 4 weeks. Maintenance: 0.5-2.4mg weekly depending on tolerance and goals.",
    "protocol": "Inject once weekly, same day each week. Best taken subcutaneously in the abdomen or thigh. Can be taken any time of day, with or without food.",
    "sideEffects": "Common: Nausea, vomiting, diarrhea, constipation. Rare: Pancreatitis, gallbladder issues, hypoglycemia (if combined with other diabetes meds).",
    "warnings": "Not recommended for individuals with a history of medullary thyroid carcinoma or MEN 2. Consult a physician before use if pregnant, breastfeeding, or have kidney disease.",
    "interactions": "May interact with insulin or sulfonylureas, increasing risk of hypoglycemia. Slows gastric emptying, which can affect absorption of oral medications.",
    "injectionAreas": "Subcutaneous injection in the abdomen, thigh, or upper arm. Rotate injection sites weekly to prevent tissue damage."
  },
  {
    "id": "collagen-peptides",
    "name": "Collagen Peptides",
    "category": "Recovery",
    "shortDescription": "Dietary supplement for skin, joint, and connective tissue health",
    "description": "Hydrolyzed collagen (short peptides) used as a dietary supplement to support skin, joint, bone, and connective tissue health. Commonly taken for improved skin elasticity, hair and nail strength, and joint comfort.",
    "mechanism": "Provides amino acids (especially glycine, proline, hydroxyproline) for collagen synthesis. May stimulate fibroblasts and cartilage cells to produce more collagen. Serves as building blocks for repairing and strengthening connective tissues.",
    "commonDoses": "2.5-15 grams per day of hydrolyzed collagen powder. Doses around 2.5-5g often benefit skin and joints; higher doses (10-15g) used for bone and muscle support.",
    "protocol": "Mix powder with water, coffee, or smoothies. Take daily, preferably with vitamin C for enhanced collagen synthesis. Can be taken any time of day. Generally well tolerated long-term.",
    "sideEffects": "Very mild. Possible digestive upset at high doses, mild allergic reactions in those sensitive to source (bovine, marine, etc.). Generally recognized as safe.",
    "warnings": "Regarded as dietary supplement, not a drug. Not FDA-regulated as medication (classified as food supplement). Widely available over the counter and not restricted in sports.",
    "interactions": "No known significant drug interactions. Safe to combine with most supplements and medications. Source may matter for those with allergies (bovine, marine, chicken, etc.).",
    "injectionAreas": "Not injectable - taken orally as powder, capsules, or liquid supplement."
  }
]
